/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct kvm_tdx_init_mem_region {
    pub source_addr: u64,
    pub gpa: u64,
    pub nr_pages: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_tdx_init_mem_region"][::std::mem::size_of::<kvm_tdx_init_mem_region>() - 24usize];
    ["Alignment of kvm_tdx_init_mem_region"]
        [::std::mem::align_of::<kvm_tdx_init_mem_region>() - 8usize];
    ["Offset of field: kvm_tdx_init_mem_region::source_addr"]
        [::std::mem::offset_of!(kvm_tdx_init_mem_region, source_addr) - 0usize];
    ["Offset of field: kvm_tdx_init_mem_region::gpa"]
        [::std::mem::offset_of!(kvm_tdx_init_mem_region, gpa) - 8usize];
    ["Offset of field: kvm_tdx_init_mem_region::nr_pages"]
        [::std::mem::offset_of!(kvm_tdx_init_mem_region, nr_pages) - 16usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct kvm_tdx_capabilities {
    pub supported_attrs: u64,
    pub supported_xfam: u64,
    pub reserved: [u64; 254usize],
    pub cpuid: kvm_bindings::kvm_cpuid2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_tdx_capabilities"][::std::mem::size_of::<kvm_tdx_capabilities>() - 2056usize];
    ["Alignment of kvm_tdx_capabilities"][::std::mem::align_of::<kvm_tdx_capabilities>() - 8usize];
    ["Offset of field: kvm_tdx_capabilities::supported_attrs"]
        [::std::mem::offset_of!(kvm_tdx_capabilities, supported_attrs) - 0usize];
    ["Offset of field: kvm_tdx_capabilities::supported_xfam"]
        [::std::mem::offset_of!(kvm_tdx_capabilities, supported_xfam) - 8usize];
    ["Offset of field: kvm_tdx_capabilities::reserved"]
        [::std::mem::offset_of!(kvm_tdx_capabilities, reserved) - 16usize];
    ["Offset of field: kvm_tdx_capabilities::cpuid"]
        [::std::mem::offset_of!(kvm_tdx_capabilities, cpuid) - 2048usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct kvm_tdx_init_vm {
    pub attributes: u64,
    pub xfam: u64,
    pub mrconfigid: [u64; 6usize],
    pub mrowner: [u64; 6usize],
    pub mrownerconfig: [u64; 6usize],
    pub reserved: [u64; 12usize],
    pub cpuid: kvm_bindings::kvm_cpuid2,
}

#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of kvm_tdx_init_vm"][::std::mem::size_of::<kvm_tdx_init_vm>() - 264usize];
    ["Alignment of kvm_tdx_init_vm"][::std::mem::align_of::<kvm_tdx_init_vm>() - 8usize];
    ["Offset of field: kvm_tdx_init_vm::attributes"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, attributes) - 0usize];
    ["Offset of field: kvm_tdx_init_vm::xfam"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, xfam) - 8usize];
    ["Offset of field: kvm_tdx_init_vm::mrconfigid"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, mrconfigid) - 16usize];
    ["Offset of field: kvm_tdx_init_vm::mrowner"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, mrowner) - 64usize];
    ["Offset of field: kvm_tdx_init_vm::mrownerconfig"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, mrownerconfig) - 112usize];
    ["Offset of field: kvm_tdx_init_vm::reserved"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, reserved) - 160usize];
    ["Offset of field: kvm_tdx_init_vm::cpuid"]
        [::std::mem::offset_of!(kvm_tdx_init_vm, cpuid) - 256usize];
};
